salara1960/stm32f411/Src/main.c
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */
  

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_RTC_Init();
  MX_TIM2_Init();
  MX_USART1_UART_Init();
  MX_I2C1_Init();
  MX_SPI4_Init();
  MX_ADC1_Init();
  /* USER CODE BEGIN 2 */

  	// start timer1 + interrupt
	HAL_TIM_Base_Start(&htim2);
	HAL_TIM_Base_Start_IT(&htim2);
    //"start" rx_interrupt
	HAL_UART_Receive_IT(&huart1, (uint8_t *)&rxByte, 1);


	set_Date(epoch);

	char *uk = NULL, *uke = NULL;
	evt_t evt;
	uint32_t schMS = 0;

	ON_ERR_LED();//!!!!!!!!!!!!!!!!!!!!!
	STROB_UP();//!!!!!!!!!!!!!!!!!!!!!


#ifdef SET_OLED_SPI
    portOLED = &hspi4;
    spi_ssd1306_Reset();
    spi_ssd1306_on(1);//screen ON
    spi_ssd1306_init();//screen INIT
    spi_ssd1306_pattern();//set any params for screen
    //spi_ssd1306_invert();
    spi_ssd1306_clear();//clear screen

    sec_to_str_time(line);
    spi_ssd1306_text_xy(line, 2, 1);
#endif


#ifdef SET_BMx280
    portBMP = &hi2c1;
    bool bStat = false;
    bool bmxCalibr = false;
    char bmxName[16] = {0};
    i2c_reset_bmx280(&reg_id);
    if (reg_id == BME280_SENSOR) {
    	d_size = 8;
    	strcpy(bmxName, bme280s);
    } else {
    	d_size = 6;
    	if (reg_id == BMP280_SENSOR) strcpy(bmxName, bmp280s); else strcpy(bmxName, bmx280s);
    }

    //bmxCalibr = bmx280_readCalibrationData(reg_id);

#endif

	portHMC = &hi2c1;
	xyz = (xyz_t *)&magBuf[0];
//	COPMAS_Reset();
	COPMAS_Init();
	cStat = COPMAS_ReadStat();
#ifdef SET_COMPAS_BLOCK
    siCmd = msg_empty;
    evt = msg_startCompas;
#else
    siCmd = msg_startCompas;
    evt = msg_i2c;
#endif
    putMsg(evt);
    next = get5ms(_1ms);

    portADC = &hadc1;
    if (startADC) HAL_ADC_Start_IT(portADC);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
	while (1)  {

		switch (getMsg()) {
		    case msg_adcReady:
		    {
		    	adcValue = (uint16_t)HAL_ADC_GetValue(portADC) & 0xfff;// * 0.80586;
		    	//
		    	if (VccAddVal(adcValue) == MAX_VCC_BUF) {//в окне накоплено MAX_VCC_BUF выборок -> фильтрация !
		    		uint16_t sum = 0;
		    		for (int8_t j = 0; j < MAX_VCC_BUF; j++) sum += VccBuf[j];
		    		sum /= MAX_VCC_BUF;
		    		VccF = (float)(sum * 0.80586) / 1000;
		    	}
		    	//
		    	startADC = 1;
		    }
		    break;
		    case msg_1ms:
		    	//HAL_GPIO_TogglePin(STROB_GPIO_Port, STROB_Pin);
		    	schMS++;
		    	if (!(schMS % (_100ms))) {// 100ms
		    		if (startADC) HAL_ADC_Start_IT(portADC);
		    		if (devError) ON_ERR_LED()
		    		         else OFF_ERR_LED()
#ifdef MIC_PRESENT
					if (tmrEXT3) {
						if (chk5ms(tmrEXT3)) {
							enEXT3 = 1;
							tmrEXT3 = 0;
						}
					}
#endif
		    	}
#ifdef SET_OLED_SPI
		    	if (!(schMS % (_250ms))) {// 250ms

		    		sprintf(line, "  temp:%.2f\n  Azimut:%u", compData.tempHMC, compData.angleHMC);
		    		spi_ssd1306_clear_line(7);
		    		spi_ssd1306_clear_line(8);
		    		spi_ssd1306_text_xy(line, 1, 7);
		    	}
#endif
		    	if (!(schMS % (_1s))) {// 1000ms
					HAL_GPIO_TogglePin(tLED_GPIO_Port, tLED_Pin);
#ifdef SET_OLED_SPI
					sec_to_str_time(line);
					sprintf(line+strlen(line), "\n devError:0x%02X\n", devError);
					sprintf(line+strlen(line), "  VCC:%.3fV\n", VccF);
		#ifdef SET_BMx280
					sprintf(line+strlen(line), "  mmHg:%.2f\n  DegC:%.2f", sensors.bmx_pres, sensors.bmx_temp);
					if (reg_id == BME280_SENSOR) sprintf(line+strlen(line), "\n  %%rH:%.2f\n", sensors.bmx_humi);
		#endif
					//spi_ssd1306_clear();
					spi_ssd1306_text_xy(line, 2, 1);
#endif
					if (!(++seconds % (5))) putMsg(msg_out);
		    	}
		    break;
			case msg_rxDone:
				Report(NULL, 0, "%s", stx);
				if ((uk = strstr(stx, "epoch=")) != NULL) {
					uk += 6;
					if (strlen(uk) >= 10) {
						uke = strchr(uk, ':');
						if (uke) {
							tZone = atoi(uke + 1);
							*uke = '\0';
						} else tZone = 0;
						uint32_t cep = atol(uk);
						if (cep > 0) {
							set_Date((time_t)cep);
						}
					}
				} else if ((uk = strstr(stx, "rst")) != NULL) {
					putMsg(msg_rst);
				}
			break;
			case msg_rst:
				HAL_Delay(1000);
				NVIC_SystemReset();
			break;
			case msg_out:
				sprintf(tmp, " | tik=%lu fifo:%u/%u", tik, cnt_evt, max_evt);
				if (devError) sprintf(tmp+strlen(tmp), " devError:0x%02X", devError);
				sprintf(tmp+strlen(tmp), " | Vcc=%.3fV", VccF);
#ifdef SET_BMx280
				sprintf(tmp+strlen(tmp)," | %s: ready=%d mmHg=%.2f degC=%.2f", bmxName, bStat, sensors.bmx_pres, sensors.bmx_temp);
				if (reg_id == BME280_SENSOR) sprintf(tmp+strlen(tmp), " %%rH=%.2f", sensors.bmx_humi);
#endif
				//compas_stat_t *cStat = (compas_stat_t *)confRegHmc;
				sprintf(tmp+strlen(tmp), " | QMC5883L: ready=%u azimut=%u temp=%.2f",
						cStat,
						compData.angleHMC,
						compData.tempHMC);//, xyz->x, xyz->y, xyz->z);
				Report(NULL, 1, "%s\r\n", tmp);
			break;
#ifndef SET_COMPAS_BLOCK
			case msg_i2c:
				switch (siCmd) {
					case msg_startCompas:
						if (chk5ms(next)) {
							STROB_DOWN();
							//
							msBegin = HAL_GetTick();
							next = 0;
							procCompas();
							//
							//STROB_UP();
						} else {
							putMsg(msg_i2c);
						}
					break;
					case msg_getCompas:
					{
						//STROB_DOWN();
						//
						if (CompAddVal(COPMAS_CalcAngle()) == MAX_COMP_BUF) {//в окне накоплено MAX_VCC_BUF выборок -> фильтрация !
							uint16_t sum = 0;
							for (int8_t j = 0; j < MAX_COMP_BUF; j++) sum += CompBuf[j];
							sum /= MAX_COMP_BUF;
							compData.angleHMC = sum;
						}
						//
						siCmd = msg_empty;
						next = get5ms(0);
						putMsg(msg_nextSens);
						//
						//STROB_UP();
					}
					break;
					case msg_rdyTest:
						//STROB_DOWN();
						//
						i2c_test_ready_bmx280(&info_bmp280);
						//
						//STROB_UP();
					break;
					case msg_rdyStat:
						//STROB_DOWN();
						bStat = i2c_getStat_bmx280();
						if (!bStat) {
							//next = get5ms(_1ms);
							siCmd = msg_rdyTest;
							putMsg(msg_i2c);
							break;
						}
						//
						if (i2c_read_data_bmx280(data_rdx, d_size) != HAL_OK) devError |= devI2C1;
						//
						//STROB_UP();
					break;
					case msg_readBMX:
						//STROB_DOWN();
						//
						if (!bmxCalibr) bmx280_readCalibr1Data(reg_id);//goto read calibration data part 1
						else {
							bmx280_CalcAll(&sensors, reg_id);
							putMsg(msg_endNext);
						}
						//
						//STROB_UP();
					break;
					case msg_calibr1Done:
						//STROB_DOWN();
						//
						bmx280_calcCalibr1Data(reg_id);
						if (reg_id == BME280_SENSOR) {
							bmx280_readCalibr2Data(reg_id);
						} else {
							bmx280_CalcAll(&sensors, reg_id);
							putMsg(msg_endNext);
						}
						//
						//STROB_UP();
					break;
					case msg_calibr2Done:
						//STROB_DOWN();
						//
						if (reg_id == BME280_SENSOR) bmx280_calcCalibr2Data();
						bmx280_CalcAll(&sensors, reg_id);
						bmxCalibr = true;
						putMsg(msg_endNext);
						//
						//STROB_UP();
					break;
				}
			break;
#else
			case msg_startCompas:
			{
				if (chk5ms(next)) {
					//STROB_DOWN();
					//
					msBegin = HAL_GetTick();
					next = 0;
					procCompas();

					//
					if (CompAddVal(COPMAS_CalcAngle()) == MAX_COMP_BUF) {//в окне накоплено MAX_VCC_BUF выборок -> фильтрация !
						uint16_t sum = 0;
						for (int8_t j = 0; j < MAX_COMP_BUF; j++) sum += CompBuf[j];
						sum /= MAX_COMP_BUF;
						compData.angleHMC = sum;
					}
					//
					putMsg(msg_nextSens);
					//
					//STROB_UP();
				} else putMsg(msg_startCompas);
			}
			break;
#endif
			case msg_nextSens:
				if (chk5ms(next)) {
					//STROB_DOWN();
					//
#ifdef SET_BMx280
					//
					if (i2c_test_bmx280(&info_bmp280, reg_id) != HAL_OK) devError |= devI2C1;
					next = get5ms(_1ms);
	#ifdef SET_COMPAS_BLOCK
					bStat = i2c_getStat_bmx280();
					if (!bStat) {
						next = get5ms(_1ms);
						putMsg(msg_nextSens);
						break;
					}
					//
					if (i2c_read_bmx280(BMP280_REG_PRESSURE, data_rdx, d_size) == HAL_OK) {
						//
						if (!bmxCalibr) bmxCalibr = bmx280_readCalibrationData(reg_id);
						//
						bmx280_CalcAll(&sensors, reg_id);
						//
					} else devError |= devI2C1;
					putMsg(msg_endNext);
	#endif
#endif
					//STROB_UP();
				} else putMsg(msg_nextSens);
			break;
			case msg_endNext:
				//
				msCnt = HAL_GetTick() - msBegin;
				if (msCnt < _250ms) {
					msCnt = _250ms - msCnt;
				} else {
					msCnt -= _250ms;
				}
				if (!msCnt) msCnt++;
				next = get5ms(msCnt);
				//
#ifdef SET_COMPAS_BLOCK
				evt = msg_startCompas;
				siCmd = msg_empty;
#else
				evt = msg_i2c;
				siCmd = msg_startCompas;
#endif
				putMsg(evt);
				//
				STROB_UP();
			break;
		}

    /* USER CODE END WHILE */

